class Message < ApplicationRecord
  belongs_to :user

  validates :content, presence: true, length: { maximum: 500 }
  validate :check_for_prohibited_words

  PROHIBITED_WORDS = [
    "死ね", "ばか", "くそ", "あほ", "バカ", "アホ", "カス", "ブス", "デブ", "ハゲ", "ゴミ", "うざい", "きもい",
    "消えろ", "殺す", "しね", "障害者", "池沼", "基地外", "差別", "在日", "朝鮮人", "部落", "穢多", "非人",
    "クソ", "ちくしょう", "ふざけんな", "てめえ", "黙れ", "うるせえ", "頭おかしい", "死ねばいい", "地獄に落ちろ",
    "首吊れ", "殺意", "自殺しろ", "死んでくれ", "グロ", "リスカ", "ブサイク", "しねしね", "発達", "学習障害",
    "キチガイ", "レイプ", "強姦", "セックス", "変態", "エロ", "ちんこ", "まんこ", "ち○こ", "ま○こ", "乳首", "陰部",
    "淫乱", "援交", "売春", "風俗", "射精", "中出し", "フェラ", "アナル", "レズ", "ゲイ", "ホモ", "童貞", "処女",
    "ニート", "無職", "底辺", "乞食", "やりまん", "やりちん", "パパ活", "メンヘラ", "精神障害", "精神病", "精神科",
    "統合失調", "躁鬱", "うつ病", "死体", "首切り", "内臓", "殺人", "爆破", "テロ", "殴る", "暴力", "暴行", "イジメ",
    "イライラ", "脅迫", "不倫", "浮気", "裏切り", "虐待", "DV", "モラハラ", "セクハラ", "パワハラ", "ブラック企業"
  ]


  private

  def check_for_prohibited_words
    PROHIBITED_WORDS.each do |bad_word|
      if content&.include?(bad_word)
        errors.add(:content, "に不適切な表現が含まれています")
        break
      end
    end
  end
end
